HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_reg.h
/** \brief 2824, TIM3 Channel 0 Control Register */
#define GTM_TIM3_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102824u)

/** \brief 2828, TIM3 Channel 0 Extended Control Register */
#define GTM_TIM3_CH0_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0102828u)

/** \brief 282C, TIM3 Channel 0 Interrupt Notification Register */
#define GTM_TIM3_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010282Cu)

/** \brief 2830, TIM3 Channel 0 Interrupt Enable Register */
#define GTM_TIM3_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102830u)

/** \brief 2834, TIM3 Channel 0 Force Interrupt Register */
#define GTM_TIM3_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102834u)

/** \brief 2838, TIM3 Channel 0 Interrupt Mode Configuration Register */
#define GTM_TIM3_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0102838u)

/** \brief 283C, TIM3 Channel 0 Error Interrupt Enable Register */
#define GTM_TIM3_CH0_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010283Cu)

/** \brief 2874, TIM3 Input Value Observation Register */
#define GTM_TIM3_INP_VAL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_INP_VAL*)0xF0102874u)

/** \brief 2878, TIM3 AUX IN Source Selection Register */
#define GTM_TIM3_IN_SRC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_IN_SRC*)0xF0102878u)

/** \brief 287C, TIM3 Global Software Reset Register */
#define GTM_TIM3_RST /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_RST*)0xF010287Cu)

/** \brief 2880, TIM3 Channel 1 General Purpose 0 Register */
#define GTM_TIM3_CH1_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102880u)

/** \brief 2884, TIM3 Channel 1 General Purpose 1 Register */
#define GTM_TIM3_CH1_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102884u)

/** \brief 2888, TIM3 Channel 1 SMU Counter Register */
#define GTM_TIM3_CH1_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102888u)

/** \brief 288C, TIM3 Channel 1 SMU Edge Counter Register */
#define GTM_TIM3_CH1_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010288Cu)

/** \brief 2890, TIM3 Channel 1 SMU Shadow Counter Register */
#define GTM_TIM3_CH1_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0102890u)

/** \brief 2894, TIM3 Channel 1 TDU Counter Register */
#define GTM_TIM3_CH1_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0102894u)

/** \brief 2898, TIM3 Channel 1 TDU Control Register */
#define GTM_TIM3_CH1_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0102898u)

/** \brief 289C, TIM3 Channel 1 Filter Parameter 0 Register */
#define GTM_TIM3_CH1_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010289Cu)

/** \brief 28A0, TIM3 Channel 1 Filter Parameter 1 Register */
#define GTM_TIM3_CH1_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF01028A0u)

/** \brief 28A4, TIM3 Channel 1 Control Register */
#define GTM_TIM3_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF01028A4u)

/** \brief 28A8, TIM3 Channel 1 Extended Control Register */
#define GTM_TIM3_CH1_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF01028A8u)

/** \brief 28AC, TIM3 Channel 1 Interrupt Notification Register */
#define GTM_TIM3_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF01028ACu)

/** \brief 28B0, TIM3 Channel 1 Interrupt Enable Register */
#define GTM_TIM3_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF01028B0u)

/** \brief 28B4, TIM3 Channel 1 Force Interrupt Register */
#define GTM_TIM3_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF01028B4u)

/** \brief 28B8, TIM3 Channel 1 Interrupt Mode Configuration Register */
#define GTM_TIM3_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF01028B8u)

/** \brief 28BC, TIM3 Channel 1 Error Interrupt Enable Register */
#define GTM_TIM3_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF01028BCu)

/** \brief 2900, TIM3 Channel 2 General Purpose 0 Register */
#define GTM_TIM3_CH2_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102900u)

/** \brief 2904, TIM3 Channel 2 General Purpose 1 Register */
#define GTM_TIM3_CH2_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102904u)

/** \brief 2908, TIM3 Channel 2 SMU Counter Register */
#define GTM_TIM3_CH2_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102908u)

/** \brief 290C, TIM3 Channel 2 SMU Edge Counter Register */
#define GTM_TIM3_CH2_ECNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECNT*)0xF010290Cu)

/** \brief 2910, TIM3 Channel 2 SMU Shadow Counter Register */
#define GTM_TIM3_CH2_CNTS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNTS*)0xF0102910u)

/** \brief 2914, TIM3 Channel 2 TDU Counter Register */
#define GTM_TIM3_CH2_TDUC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUC*)0xF0102914u)

/** \brief 2918, TIM3 Channel 2 TDU Control Register */
#define GTM_TIM3_CH2_TDUV /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_TDUV*)0xF0102918u)

/** \brief 291C, TIM3 Channel 2 Filter Parameter 0 Register */
#define GTM_TIM3_CH2_FLT_RE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_RE*)0xF010291Cu)

/** \brief 2920, TIM3 Channel 2 Filter Parameter 1 Register */
#define GTM_TIM3_CH2_FLT_FE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_FLT_FE*)0xF0102920u)

/** \brief 2924, TIM3 Channel 2 Control Register */
#define GTM_TIM3_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CTRL*)0xF0102924u)

/** \brief 2928, TIM3 Channel 2 Extended Control Register */
#define GTM_TIM3_CH2_ECTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_ECTRL*)0xF0102928u)

/** \brief 292C, TIM3 Channel 2 Interrupt Notification Register */
#define GTM_TIM3_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_NOTIFY*)0xF010292Cu)

/** \brief 2930, TIM3 Channel 2 Interrupt Enable Register */
#define GTM_TIM3_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_EN*)0xF0102930u)

/** \brief 2934, TIM3 Channel 2 Force Interrupt Register */
#define GTM_TIM3_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_FORCINT*)0xF0102934u)

/** \brief 2938, TIM3 Channel 2 Interrupt Mode Configuration Register */
#define GTM_TIM3_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_IRQ_MODE*)0xF0102938u)

/** \brief 293C, TIM3 Channel 2 Error Interrupt Enable Register */
#define GTM_TIM3_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_EIRQ_EN*)0xF010293Cu)

/** \brief 2980, TIM3 Channel 3 General Purpose 0 Register */
#define GTM_TIM3_CH3_GPR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR0*)0xF0102980u)

/** \brief 2984, TIM3 Channel 3 General Purpose 1 Register */
#define GTM_TIM3_CH3_GPR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_GPR1*)0xF0102984u)

/** \brief 2988, TIM3 Channel 3 SMU Counter Register */
#define GTM_TIM3_CH3_CNT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_TIM_CH_CNT*)0xF0102988u)

