HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_reg.h
/** \brief EA000, ATOM4 Channel 0 ARU read address Register */
#define GTM_ATOM4_CH0_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA000u)

/** \brief EA004, ATOM4 Channel 0 Control Register */
#define GTM_ATOM4_CH0_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA004u)

/** \brief EA004, ATOM4 Channel 0 Control Register in SOMB Mode */
#define GTM_ATOM4_CH0_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA004u)

/** \brief EA004, ATOM4 Channel 0 Control Register in SOMC Mode */
#define GTM_ATOM4_CH0_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA004u)

/** \brief EA004, ATOM4 Channel 0 Control Register in SOMI Mode */
#define GTM_ATOM4_CH0_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA004u)

/** \brief EA004, ATOM4 Channel 0 Control Register in SOMP Mode */
#define GTM_ATOM4_CH0_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA004u)

/** \brief EA004, ATOM4 Channel 0 Control Register in SOMS Mode */
#define GTM_ATOM4_CH0_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA004u)

/** \brief EA008, ATOM4 Channel 0 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH0_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA008u)

/** \brief EA00C, ATOM4 Channel 0 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH0_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA00Cu)

/** \brief EA010, ATOM4 Channel 0 CCU0 Compare Register */
#define GTM_ATOM4_CH0_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA010u)

/** \brief EA014, ATOM4 Channel 0 CCU1 Compare Register */
#define GTM_ATOM4_CH0_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA014u)

/** \brief EA018, ATOM4 Channel 0 CCU0 Counter Register */
#define GTM_ATOM4_CH0_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA018u)

/** \brief EA01C, ATOM4 Channel 0 Status Register */
#define GTM_ATOM4_CH0_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA01Cu)

/** \brief EA020, ATOM4 Channel 0 Interrupt Notification Register */
#define GTM_ATOM4_CH0_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_NOTIFY*)0xF01EA020u)

/** \brief EA024, ATOM4 Channel 0 Interrupt Enable Register */
#define GTM_ATOM4_CH0_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_EN*)0xF01EA024u)

/** \brief EA028, ATOM4 Channel 0 Software Interrupt Generation Register */
#define GTM_ATOM4_CH0_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_FORCINT*)0xF01EA028u)

/** \brief EA02C, ATOM4 Channel 0 Interrupt Mode Configuration Register */
#define GTM_ATOM4_CH0_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_IRQ_MODE*)0xF01EA02Cu)

/** \brief EA040, ATOM4 AGC Global Control Register */
#define GTM_ATOM4_AGC_GLB_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_GLB_CTRL*)0xF01EA040u)

/** \brief EA044, ATOM4 AGC Enable/Disable Control Register */
#define GTM_ATOM4_AGC_ENDIS_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_CTRL*)0xF01EA044u)

/** \brief EA048, ATOM4 AGC Enable/Disable Status Register */
#define GTM_ATOM4_AGC_ENDIS_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ENDIS_STAT*)0xF01EA048u)

/** \brief EA04C, ATOM4 AGC Action Time Base Register */
#define GTM_ATOM4_AGC_ACT_TB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_ACT_TB*)0xF01EA04Cu)

/** \brief EA050, ATOM4 AGC Output Enable Control Register */
#define GTM_ATOM4_AGC_OUTEN_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_CTRL*)0xF01EA050u)

/** \brief EA054, ATOM4 AGC Output Enable Status Register */
#define GTM_ATOM4_AGC_OUTEN_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_OUTEN_STAT*)0xF01EA054u)

/** \brief EA058, ATOM4 AGC Force Update Control Register */
#define GTM_ATOM4_AGC_FUPD_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_FUPD_CTRL*)0xF01EA058u)

/** \brief EA05C, ATOM4 AGC Internal Trigger Control Register */
#define GTM_ATOM4_AGC_INT_TRIG /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_AGC_INT_TRIG*)0xF01EA05Cu)

/** \brief EA080, ATOM4 Channel 1 ARU read address Register */
#define GTM_ATOM4_CH1_RDADDR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_RDADDR*)0xF01EA080u)

/** \brief EA084, ATOM4 Channel 1 Control Register */
#define GTM_ATOM4_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CTRL*)0xF01EA084u)

/** \brief EA084, ATOM4 Channel 1 Control Register in SOMB Mode */
#define GTM_ATOM4_CH1_SOMB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMB*)0xF01EA084u)

/** \brief EA084, ATOM4 Channel 1 Control Register in SOMC Mode */
#define GTM_ATOM4_CH1_SOMC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMC*)0xF01EA084u)

/** \brief EA084, ATOM4 Channel 1 Control Register in SOMI Mode */
#define GTM_ATOM4_CH1_SOMI /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMI*)0xF01EA084u)

/** \brief EA084, ATOM4 Channel 1 Control Register in SOMP Mode */
#define GTM_ATOM4_CH1_SOMP /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMP*)0xF01EA084u)

/** \brief EA084, ATOM4 Channel 1 Control Register in SOMS Mode */
#define GTM_ATOM4_CH1_SOMS /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SOMS*)0xF01EA084u)

/** \brief EA088, ATOM4 Channel 1 CCU0 Compare Shadow Register */
#define GTM_ATOM4_CH1_SR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR0*)0xF01EA088u)

/** \brief EA08C, ATOM4 Channel 1 CCU1 Compare Shadow Register */
#define GTM_ATOM4_CH1_SR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_SR1*)0xF01EA08Cu)

/** \brief EA090, ATOM4 Channel 1 CCU0 Compare Register */
#define GTM_ATOM4_CH1_CM0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM0*)0xF01EA090u)

/** \brief EA094, ATOM4 Channel 1 CCU1 Compare Register */
#define GTM_ATOM4_CH1_CM1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CM1*)0xF01EA094u)

/** \brief EA098, ATOM4 Channel 1 CCU0 Counter Register */
#define GTM_ATOM4_CH1_CN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_CN0*)0xF01EA098u)

/** \brief EA09C, ATOM4 Channel 1 Status Register */
#define GTM_ATOM4_CH1_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_ATOM_CH_STAT*)0xF01EA09Cu)

