HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxGtm_reg.h
/** \brief F4064, MCS4 Control and Status Register */
#define GTM_MCS4_CTRL_STAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CTRL_STAT*)0xF01F4064u)

/** \brief F4068, MCS4 Reset Register */
#define GTM_MCS4_RESET /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_RESET*)0xF01F4068u)

/** \brief F406C, MCS4 Cancel ARU Transfer Instruction Register */
#define GTM_MCS4_CAT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CAT*)0xF01F406Cu)

/** \brief F4070, MCS4 Cancel WURM Instruction Register */
#define GTM_MCS4_CWT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CWT*)0xF01F4070u)

/** \brief F407C, MCS4 error register */
#define GTM_MCS4_ERR /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_ERR*)0xF01F407Cu)

/** \brief F4080, MCS4 Channel 1 General Purpose Register 0 */
#define GTM_MCS4_CH1_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4080u)

/** \brief F4084, MCS4 Channel 1 General Purpose Register 1 */
#define GTM_MCS4_CH1_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4084u)

/** \brief F4088, MCS4 Channel 1 General Purpose Register 2 */
#define GTM_MCS4_CH1_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4088u)

/** \brief F408C, MCS4 Channel 1 General Purpose Register 3 */
#define GTM_MCS4_CH1_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F408Cu)

/** \brief F4090, MCS4 Channel 1 General Purpose Register 4 */
#define GTM_MCS4_CH1_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4090u)

/** \brief F4094, MCS4 Channel 1 General Purpose Register 5 */
#define GTM_MCS4_CH1_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4094u)

/** \brief F4098, MCS4 Channel 1 General Purpose Register 6 */
#define GTM_MCS4_CH1_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4098u)

/** \brief F409C, MCS4 Channel 1 General Purpose Register 7 */
#define GTM_MCS4_CH1_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F409Cu)

/** \brief F40A0, MCS4 Channel 1 Control Register */
#define GTM_MCS4_CH1_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F40A0u)

/** \brief F40A4, MCS4 Channel 1 ARU Control Bit Register */
#define GTM_MCS4_CH1_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F40A4u)

/** \brief F40BC, MCS4 Channel 1 Memory High Byte Register */
#define GTM_MCS4_CH1_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F40BCu)

/** \brief F40C0, MCS4 Channel 1 Program Counter Register */
#define GTM_MCS4_CH1_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F40C0u)

/** \brief F40C4, MCS4 Channel 1 Interrupt Notification Register */
#define GTM_MCS4_CH1_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F40C4u)

/** \brief F40C8, MCS4 Channel 1 Interrupt Enable Register */
#define GTM_MCS4_CH1_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F40C8u)

/** \brief F40CC, MCS4 Channel 1 Force Interrupt Register */
#define GTM_MCS4_CH1_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F40CCu)

/** \brief F40D0, MCS4 Channel 1 Interrupt Mode Configuration Register */
#define GTM_MCS4_CH1_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F40D0u)

/** \brief F40D4, MCS4 Channel 1 Error Interrupt Enable Register */
#define GTM_MCS4_CH1_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F40D4u)

/** \brief F4100, MCS4 Channel 2 General Purpose Register 0 */
#define GTM_MCS4_CH2_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4100u)

/** \brief F4104, MCS4 Channel 2 General Purpose Register 1 */
#define GTM_MCS4_CH2_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4104u)

/** \brief F4108, MCS4 Channel 2 General Purpose Register 2 */
#define GTM_MCS4_CH2_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4108u)

/** \brief F410C, MCS4 Channel 2 General Purpose Register 3 */
#define GTM_MCS4_CH2_R3 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F410Cu)

/** \brief F4110, MCS4 Channel 2 General Purpose Register 4 */
#define GTM_MCS4_CH2_R4 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4110u)

/** \brief F4114, MCS4 Channel 2 General Purpose Register 5 */
#define GTM_MCS4_CH2_R5 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4114u)

/** \brief F4118, MCS4 Channel 2 General Purpose Register 6 */
#define GTM_MCS4_CH2_R6 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4118u)

/** \brief F411C, MCS4 Channel 2 General Purpose Register 7 */
#define GTM_MCS4_CH2_R7 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F411Cu)

/** \brief F4120, MCS4 Channel 2 Control Register */
#define GTM_MCS4_CH2_CTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_CTRL*)0xF01F4120u)

/** \brief F4124, MCS4 Channel 2 ARU Control Bit Register */
#define GTM_MCS4_CH2_ACB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_ACB*)0xF01F4124u)

/** \brief F413C, MCS4 Channel 2 Memory High Byte Register */
#define GTM_MCS4_CH2_MHB /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_MHB*)0xF01F413Cu)

/** \brief F4140, MCS4 Channel 2 Program Counter Register */
#define GTM_MCS4_CH2_PC /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_PC*)0xF01F4140u)

/** \brief F4144, MCS4 Channel 2 Interrupt Notification Register */
#define GTM_MCS4_CH2_IRQ_NOTIFY /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_NOTIFY*)0xF01F4144u)

/** \brief F4148, MCS4 Channel 2 Interrupt Enable Register */
#define GTM_MCS4_CH2_IRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_EN*)0xF01F4148u)

/** \brief F414C, MCS4 Channel 2 Force Interrupt Register */
#define GTM_MCS4_CH2_IRQ_FORCINT /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_FORCINT*)0xF01F414Cu)

/** \brief F4150, MCS4 Channel 2 Interrupt Mode Configuration Register */
#define GTM_MCS4_CH2_IRQ_MODE /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_IRQ_MODE*)0xF01F4150u)

/** \brief F4154, MCS4 Channel 2 Error Interrupt Enable Register */
#define GTM_MCS4_CH2_EIRQ_EN /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_EIRQ_EN*)0xF01F4154u)

/** \brief F4180, MCS4 Channel 3 General Purpose Register 0 */
#define GTM_MCS4_CH3_R0 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4180u)

/** \brief F4184, MCS4 Channel 3 General Purpose Register 1 */
#define GTM_MCS4_CH3_R1 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4184u)

/** \brief F4188, MCS4 Channel 3 General Purpose Register 2 */
#define GTM_MCS4_CH3_R2 /*lint --e(923, 9078)*/ (*(volatile Ifx_GTM_MCS_CH_R*)0xF01F4188u)

